# Python Day 17 & 18

# Pandas
 adds data structures and tools designed to work with table-like data (similar to Series and Data Frames in R)

 provides tools for data manipulation: reshaping, merging, sorting, slicing, aggregation etc.

 allows handling missing data

In [3]:
#Import Python Libraries
 
import pandas as pd

In [4]:
df = pd.read_csv("C:/Users/ayush/Desktop/Salaries (1).csv")
df

    rank discipline   phd  service     sex  salary
0   Prof          B  56.0       49    Male  186960
1   Prof          A  12.0        6    Male   93000
2   Prof          A  23.0       20    Male  110515
3   Prof          A  40.0       31    Male  131205
4   Prof          B  20.0       18    Male  104800
..   ...        ...   ...      ...     ...     ...
75  Prof          B   NaN       17    Male  124312
76  Prof          B  17.0       17  Female  124312
77  Prof          A  28.0       14  Female  109954
78  Prof          A  23.0       15  Female  109646
79  Prof        NaN  23.0       15    Male  109646

[80 rows x 6 columns]

There is a number of pandas commands to read other data formats: Install xlrd for excel data

Command : python -m pip install xlrd

pd.read_excel('myfile.xlsx',sheet_name='Sheet1', index_col=None, na_values=['NA']) 

pd.read_stata('myfile.dta')

pd.read_sas('myfile.sas7bdat')

pd.read_hdf('myfile.h5','df')

 # Exploring data frames

In [4]:
# List first 5 records
df.head(10)

        rank discipline   phd  service   sex  salary
0       Prof          B  56.0       49  Male  186960
1       Prof          A  12.0        6  Male   93000
2       Prof          A  23.0       20  Male  110515
3       Prof          A  40.0       31  Male  131205
4       Prof          B  20.0       18  Male  104800
5       Prof          A  20.0       20  Male  122400
6  AssocProf          A  20.0       17  Male   81285
7       Prof          A  18.0       18  Male  126300
8       Prof          A  29.0       19  Male   94350
9       Prof          A  51.0       51  Male   57800

In [10]:
df.tail(10)

         rank discipline   phd  service     sex  salary
70   AsstProf          A   8.0        3  Female   78500
71  AssocProf          B  12.0        9  Female   71065
72       Prof          B  24.0       15  Female  161101
73       Prof          B  18.0       10  Female  105450
74  AssocProf          B  19.0        6  Female  104542
75       Prof          B   NaN       17    Male  124312
76       Prof          B  17.0       17  Female  124312
77       Prof          A  28.0       14  Female  109954
78       Prof          A  23.0       15  Female  109646
79       Prof        NaN  23.0       15    Male  109646

In [5]:
df.describe()

             phd    service         salary
count  79.000000  80.000000      80.000000
mean   19.746835  15.075000  108247.662500
std    12.423580  11.987097   27992.954448
min     1.000000   0.000000   57800.000000
25%    10.500000   5.750000   89837.500000
50%    19.000000  15.000000  104900.000000
75%    27.500000  20.250000  126458.250000
max    56.000000  51.000000  186960.000000

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80 entries, 0 to 79
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   rank        80 non-null     object
 1   discipline  79 non-null     object
 2   phd         79 non-null     float64
 3   service     80 non-null     int64
 4   sex         80 non-null     object
 5   salary      80 non-null     int64
dtypes: float64(1), int64(2), object(3)
memory usage: 3.9+ KB

In [13]:
df.shape

(80, 6)

In [14]:
df.size

480

In [16]:
#Check a particular column type
df['salary'].dtype

dtype('int64')

In [17]:
df['phd'].dtype

dtype('float64')

In [18]:
#Check types for all the columns
df.dtypes

rank           object
discipline     object
phd           float64
service         int64
sex            object
salary          int64
dtype: object

In [19]:
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

 # Selecting a column in a Data Frame

Method 1: Subset the data frame using column name: df['phd']
        
Method 2: Use the column name as an attribute: df.phd

In [7]:
xyz = df[['phd','service','rank']]

In [6]:
df.head()

   rank discipline   phd  service   sex  salary
0  Prof          B  56.0       49  Male  186960
1  Prof          A  12.0        6  Male   93000
2  Prof          A  23.0       20  Male  110515
3  Prof          A  40.0       31  Male  131205
4  Prof          B  20.0       18  Male  104800

In [21]:
xyz.head()

    phd  service  rank
0  56.0       49  Prof
1  12.0        6  Prof
2  23.0       20  Prof
3  40.0       31  Prof
4  20.0       18  Prof

 # Data Frames groupby method

Using "group by" method we can:

• Split the data into groups based on some criteria

• Calculate statistics (or apply a function) to each group

• Similar to dplyr() function in R

In [5]:
df['rank'].unique()

array(['Prof', 'AssocProf', 'AsstProf'], dtype=object)

In [28]:
df['salary'].nunique()

73

In [23]:
#Group data using rank
df_rank = df.groupby(['rank'])

In [30]:
#Calculate mean value for each numeric column per each group
df_rank.mean()

                 phd    service         salary
rank
AssocProf  15.076923  11.307692   91786.230769
AsstProf    5.052632   2.210526   81362.789474
Prof       26.978723  21.187500  123347.895833

Once groupby object is create we can calculate various statistics for each group:

In [9]:
#Calculate mean salary for each professor rank:
df.groupby('rank')[['salary']].mean()

                  salary
rank
AssocProf   91786.230769
AsstProf    81362.789474
Prof       123347.895833

groupby performance notes:

- no grouping/splitting occurs until it's needed. Creating the groupby object only verifies that you have passed a valid mapping

- by default the group keys are sorted during the groupby operation. You may want to pass sort=False for potential speedup:

In [10]:
df.groupby([df['sex']])[['salary']].sum()

         salary
sex
Female  3939094
Male    4720719

In [11]:
#Calculate mean salary for each professor rank:
a =df.groupby([df['sex']=='Female'])[['salary']].sum()

In [24]:
a

        salary
sex
False  4720719
True   3939094

 # Data Frame: filtering

To subset the data we can apply Boolean indexing. This indexing is commonly known as a filter. For example if we want to subset the rows in which the salary value is greater than $120K:

In [13]:
#Calculate mean salary for each professor rank:
df_sub = df[df['phd'] > 50 ]

In [14]:
df_sub.head()

   rank discipline   phd  service   sex  salary
0  Prof          B  56.0       49  Male  186960
9  Prof          A  51.0       51  Male   57800

Any Boolean operator can be used to subset the data:

> greater; < less; == equal;
>= greater or equal; <= less or equal;
!= not equal;

In [15]:
#Select only those rows that contain female professors:
df_f = df[ df['sex'] == 'Female' ].mean()
df_f

C:\Users\ayush\AppData\Local\Temp\ipykernel_3964\581389329.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df_f = df[ df['sex'] == 'Female' ].mean()

phd            16.512821
service        11.564103
salary     101002.410256
dtype: float64

In [16]:
df_f.head()

phd            16.512821
service        11.564103
salary     101002.410256
dtype: float64

# day 18 
#  Data Frames: Slicing


There are a number of ways to subset the Data Frame:
    
• one or more columns

• one or more rows

• a subset of rows and columns

Rows and columns can be selected by their position or label

When selecting one column, it is possible to use single set of brackets, but the resulting object will be a Series (not a DataFrame):

In [17]:
#Select column salary:
df['salary']

0     186960
1      93000
2     110515
3     131205
4     104800
       ...
75    124312
76    124312
77    109954
78    109646
79    109646
Name: salary, Length: 80, dtype: int64

When we need to select more than one column and/or make the output to be a DataFrame, we should use double brackets:

In [18]:
#Select column salary:
df[['rank','salary','phd']]

    rank  salary   phd
0   Prof  186960  56.0
1   Prof   93000  12.0
2   Prof  110515  23.0
3   Prof  131205  40.0
4   Prof  104800  20.0
..   ...     ...   ...
75  Prof  124312   NaN
76  Prof  124312  17.0
77  Prof  109954  28.0
78  Prof  109646  23.0
79  Prof  109646  23.0

[80 rows x 3 columns]

If we need to select a range of rows, we can specify the range using ":"

In [19]:
#Select rows by their position:
df[10:20]

        rank discipline   phd  service   sex  salary
10      Prof          B  39.0       33  Male  128250
11      Prof          B  23.0       23  Male  134778
12  AsstProf          B   1.0        0  Male   88000
13      Prof          B  35.0       33  Male  162200
14      Prof          B  25.0       19  Male  153750
15      Prof          B  17.0        3  Male  150480
16  AsstProf          B   8.0        3  Male   75044
17  AsstProf          B   4.0        0  Male   92000
18      Prof          A  19.0        7  Male  107300
19      Prof          A  29.0       27  Male  150500

Notice that the first row has a position 0, and the last value in the range is omitted: So for 0:10 range the first 10 rows are returned with the positions starting with 0 and ending with 9

#  Data Frames: method loc

if we need to select a range of rows, using their labels we can use method loc:

In [26]:

#Select rows by their labels:
df.loc[10:20,['rank','sex','salary']]

        rank   sex  salary
10      Prof  Male  128250
11      Prof  Male  134778
12  AsstProf  Male   88000
13      Prof  Male  162200
14      Prof  Male  153750
15      Prof  Male  150480
16  AsstProf  Male   75044
17  AsstProf  Male   92000
18      Prof  Male  107300
19      Prof  Male  150500
20  AsstProf  Male   92000

#  Data Frames: method iloc

If we need to select a range of rows and/or columns, using their positions we can use method iloc:

In [21]:
#select rows by their labels:
df.iloc[10:20,[0, 3, 4, 5]]

        rank  service   sex  salary
10      Prof       33  Male  128250
11      Prof       23  Male  134778
12  AsstProf        0  Male   88000
13      Prof       33  Male  162200
14      Prof       19  Male  153750
15      Prof        3  Male  150480
16  AsstProf        3  Male   75044
17  AsstProf        0  Male   92000
18      Prof        7  Male  107300
19      Prof       27  Male  150500

# Summary

df.iloc[0] # First row of a data frame 

df.iloc[i] #(i+1)th row

df.iloc[-1] # Last row

df.iloc[:, 0] # First column 

df.iloc[:, -1] # Last column

df.iloc[0:7] #First 7 rows

df.iloc[:, 0:2] #First 2 columns

df.iloc[1:3, 0:2] #Second through third rows and first 2 columns 

df.iloc[[0,5], [1,3]] #1st and 6th rows and 2nd and 4th columns

#  Data Frames: Sorting

We can sort the data by a value in the column. By default the sorting will occur in ascending order and a new data frame is return.

In [22]:
# Create a new data frame from the original sorted by the column Salary
df_sorted = df.sort_values( by ='service') 
df_sorted

        rank discipline   phd  service     sex  salary
23  AsstProf          A   2.0        0    Male   85000
43  AsstProf          B   5.0        0  Female   77000
52      Prof          A  12.0        0  Female  105000
55  AsstProf          A   2.0        0  Female   72500
17  AsstProf          B   4.0        0    Male   92000
..       ...        ...   ...      ...     ...     ...
40      Prof          A  39.0       36  Female  137000
27      Prof          A  45.0       43    Male  155865
36      Prof          B  45.0       45    Male  146856
0       Prof          B  56.0       49    Male  186960
9       Prof          A  51.0       51    Male   57800

[80 rows x 6 columns]

We can sort the data using 2 or more columns:

In [36]:
df_sorted = df.sort_values( by =['service', 'salary'], ascending = [False, False]) 
df_sorted.head(20)

         rank discipline   phd  service     sex  salary
9        Prof          A  51.0       51    Male   57800
0        Prof          B  56.0       49    Male  186960
36       Prof          B  45.0       45    Male  146856
27       Prof          A  45.0       43    Male  155865
40       Prof          A  39.0       36  Female  137000
13       Prof          B  35.0       33    Male  162200
10       Prof          B  39.0       33    Male  128250
3        Prof          A  40.0       31    Male  131205
25       Prof          B  35.0       31    Male   99418
21       Prof          A  33.0       30    Male  103106
19       Prof          A  29.0       27    Male  150500
63       Prof          A  29.0       27  Female   91000
58       Prof          B  36.0       26  Female  144651
45       Prof          B  25.0       25  Female  140096
64  AssocProf          A  26.0       24  Female   73300
11       Prof          B  23.0       23    Male  134778
35       Prof          B  28.0       23    Male  126933
24       Prof          A  30.0       23    Male   91100
54  AssocProf          A  25.0       22  Female   62884
31       Prof          B  22.0       21    Male  155750

# Missing Values

Missing values are marked as NaN

In [61]:
df.isnull()

     rank  discipline    phd  service    sex  salary
0   False       False  False    False  False   False
1   False       False  False    False  False   False
2   False       False  False    False  False   False
3   False       False  False    False  False   False
4   False       False  False    False  False   False
..    ...         ...    ...      ...    ...     ...
75  False       False   True    False  False   False
76  False       False  False    False  False   False
77  False       False  False    False  False   False
78  False       False  False    False  False   False
79  False        True  False    False  False   False

[80 rows x 6 columns]

In [30]:
# Select the rows that have at least one missing value
df[df.isnull().any(axis=1)]

    rank discipline   phd  service   sex  salary
75  Prof          B   NaN       17  Male  124312
79  Prof        NaN  23.0       15  Male  109646

In [ ]:
df.isnull().sum()

rank          0
discipline    1
phd           1
service       0
sex           0
salary        0
dtype: int64

There are a number of methods to deal with missing values in the data frame:


• When summing the data, missing values will be treated as zero

• If all values are missing, the sum will be equal to NaN

• cumsum() and cumprod() methods ignore missing values but preserve them in the resulting arrays

• Missing values in GroupBy method are excluded (just like in R)

• Many descriptive statistics methods have skipna option to control if missing data should be excluded . This value is set to True by default (unlike R)

#  Aggregation Functions in Pandas


Aggregation - computing a summary statistic about each group, i.e.

• compute group sums or means
• compute group sizes/counts

Common aggregation functions:

min, max
count, sum, prod
mean, median, mode, mad std, var

In [ ]:
# agg() method are useful when multiple statistics are computed per column:

In [62]:
df['salary'].median()

104900.0

In [ ]:
df[['service','salary']].agg(['min','max'])

     service  salary
min        0   57800
max       51  186960

# TASK

1. display all female profs?

2. display all profs with phd > 50?

3. display mean of salary of male?

4. display sum, mean and count of phd and salary column?

5. display 20 random records.

6. Display rows from 20 to 50.

In [31]:
df[20:50]

         rank discipline   phd  service     sex  salary
20   AsstProf          B   4.0        4    Male   92000
21       Prof          A  33.0       30    Male  103106
22   AsstProf          A   4.0        2    Male   73000
23   AsstProf          A   2.0        0    Male   85000
24       Prof          A  30.0       23    Male   91100
25       Prof          B  35.0       31    Male   99418
26       Prof          A  38.0       19    Male  148750
27       Prof          A  45.0       43    Male  155865
28   AsstProf          B   7.0        2    Male   91300
29       Prof          B  21.0       20    Male  123683
30  AssocProf          B   9.0        7    Male  107008
31       Prof          B  22.0       21    Male  155750
32       Prof          A  27.0       19    Male  103275
33       Prof          B  18.0       18    Male  120000
34  AssocProf          B  12.0        8    Male  119800
35       Prof          B  28.0       23    Male  126933
36       Prof          B  45.0       45    Male  146856
37       Prof          A  20.0        8    Male  102000
38   AsstProf          B   4.0        3    Male   91000
39       Prof          B  18.0       18  Female  129000
40       Prof          A  39.0       36  Female  137000
41  AssocProf          A  13.0        8  Female   74830
42   AsstProf          B   4.0        2  Female   80225
43   AsstProf          B   5.0        0  Female   77000
44       Prof          B  23.0       19  Female  151768
45       Prof          B  25.0       25  Female  140096
46   AsstProf          B  11.0        3  Female   74692
47  AssocProf          B  11.0       11  Female  103613
48       Prof          B  17.0       17  Female  111512
49       Prof          B  17.0       18  Female  122960